#!/bin/bash

# 05-b-4700

# Да се напише shell скрипт, който форматира големи числа, за да са по-лесни за четене.
# Като пръв аргумент на скрипта се подава цяло число.
# Като втори незадължителен аргумент се подава разделител. По подразбиране цифрите се разделят с празен интервал.

# Примери:
# $ ./nicenumber.sh 1889734853
# 1 889 734 853

# $ ./nicenumber.sh 7632223 ,
# 7,632,223

[ $# -ne 1 ] && [ $# -ne 2 ] && echo "ERROR: Incorrect number of params." && exit 1

del=" "

[ $# -eq 2 ] && del=$2

echo $1 | rev | sed "s/.../&$del/g;s/$del$//" | rev
