#!/bin/bash

# 02-a-0100
# Направете копие на файла /etc/passwd във вашата home директория под името my_passwd.
cp /etc/passwd my_passwd

# 02-a-0500
# Направете директория practice-test в home директорията ви. Вътре направете директория test1. Можете ли да направите тези две неща наведнъж? Разгледайте нужната man страница. След това създайте празен файл вътре, който да се казва test.txt, преместете го в practice-test чрез релативни пътища.
mkdir -p practice-test/test1
touch practice-test/test1/test.txt
mv practice-test/test1/test.txt practice-test/

# 02-a-0600
# Създайте директорията /tmp/os_<ФН>/practice/01/, където <ФН> е вашият факултетен номер. Създайте 3 файла в нея - f1, f2, f3. Копирайте файловете f1, f2, f3 от директорията /tmp/os_<ФН>/practice/01/ в директория dir1, намираща се във вашата home директория. Ако нямате такава, създайте я.
mkdir -p /tmp/os_62179/practice/01/
touch /tmp/os_62179/practice/01/f{1,2,3}
mkdir dir1
cp /tmp/os_62179/practice/01/f{1,2,3} dir1

# 02-a-0601
# Нека файлът f2 бъде преместен в директория dir2, намираща се във вашата home директория и бъде преименуван на numbers.
mkdir dir2
mv dir1/f2 dir2/numbers

# 02-a-1200
# Отпечатайте имената на всички директории в директорията /home.
ls -l /home

# 02-a-4000
# Създайте файл permissions.txt в home директорията си. За него дайте единствено - read права на потребителя създал файла, write and exec на групата, read and exec на всички останали. Направете го и с битове, и чрез "буквички".
touch permissions.txt
chmod 0435 permissions.txt
chmod u=r,g=wx,o=rx persmissions.txt

# 02-a-4100
# За да намерите какво сте правили днес: намерете всички файлове в home директорията ви, които са променени в последния 1 час.
find . -type f -mmin -60

# 02-a-5000
# Копирайте /etc/services в home директорията си. Прочетете го с командата cat. (Ако този файл го няма, прочетете с cat произволен текстов файл напр. /etc/passwd)
cp /etc/services .
cat services

# 02-a-5200
# Създайте symlink на файла /etc/passwd в home директорията ви (да се казва например passwd_symlink).
ln -s /etc/passwd passwd_symlink

# 02-a-5400
# Изведете всички обикновени ("regular") файлове, които /etc и нейните преки поддиректории съдържат
find /etc/ -type f -maxdepth 2 -mindepth 2

# 02-a-5401
# Изведете само първите 5 реда от /etc/services
head -n 5 /etc/services

# 02-a-5402
# Изведете всички обикновени ("regular") файлове, които само преките поддиректории на /etc съдържат
find /etc -maxdepth 1 -type f

# 02-a-5403
# Изведете всички преки поддиректории на /etc
find /etc -maxdepth 1 -type d

# 02-a-5500
# Създайте файл, който да съдържа само последните 10 реда от изхода на 02-a-5403
find /etc -maxdepth 1 -type d | tail -n 10

# 02-a-5501
# Изведете обикновените файлове по-големи от 42 байта в home директорията ви
find . -type f -size +42c

# 02-a-5504
# Изведете всички обикновени файлове в директорията /tmp които са от вашата група, които имат write права за достъп за група или за останалите(o=w)
find /tmp -type f -group $(id -g -n s62179) -perm g=w,o=w  2> /dev/null

# 02-a-5505
# Изведете всички файлове, които са по-нови от /tmp/os2018/practice/01/f1 ( би трябвало да е създаден като част от по-ранна задача ).
find . -type f -cnewer /tmp/os_62179/practice/01/f1

# 02-a-5506
# Изтрийте файловете в home директорията си по-нови от /tmp/os2018/practice/01/f2 (подайте на rm опция -i за да може да изберете само тези които искате да изтриете).
rm -i $(find . -type f -cnewer /tmp/os_62179/practice/01/f1)

# 02-a-6000
# Намерете файловете в /bin, които могат да се четат, пишат и изпълняват от всички.
find /bin -type f -perm /777

# 02-a-8000
# Копирайте всички файлове от /bin, които могат да се четат, пишат и изпълняват от всички, в bin2 директория в home директорията ви. Направете такава, ако нямате.
mkdir bin2
cp $(find /bin -type f -perm -777) bin2

# 02-a-8000 newer 2022
# Копирайте всички файлове от /etc, които могат да се четат от всички, в
# директория myetc в home директорията ви. Направете такава, ако нямате.
cp $(find /etc -type f -perm -444) myetc/

# 02-a-9000
# от предната задача: когато вече сте получили bin2 с команди, архивирайте всички команди вътре, които започват с b в архив, който се казва b_start.tar. (командата, която архивира е tar -c -f <файл1> <файл2>...)
tar -cf b_start.tar $(ls bin2 | grep '^b.*' | sed 's/^\(.*\)/bin2\/\1/g' | tr '\n' ' ')

# 02-a-9500
# Използвайки едно извикване на командата find, отпечатайте броя на редовете във всеки обикновен файл в /etc директорията.
find /etc -maxdepth 1 -type f -exec wc -l {} \;

# 02-b-4000
# Копирайте най-големия файл от тези, намиращи се в /etc, в home директорията си.
cp $(wc -c $(find /etc -maxdepth 1 -type f) 2> /dev/null | sort -n -k 1 | tail -n 2 | head -n 1 | cut -d " " -f 3) .
